routes/web.php

  Route::get('/nasabah/{NasabahId}', [NasabahController::class, 'show'])
    ->name('nasabah.show');

  Route::get('/nasabah', [NasabahController::class, 'tableNasabah']);
});
---
select * from `nasabah`