app/Http/Controllers/NasabahController.php

select min(`startingDateGP`) as aggregate from `nasabah`
select max(`endDateGP`) as aggregate from `nasabah`
select * from `nasabah`
select * from `nasabah` where `startingDateGP` >= '2022-01-01' and `endDateGP` <= '2023-12-24'
---
  public function index(Request $request)
  {
    $namaFile = $request->input('nama_file');

    $from = $request->input('from', Nasabah::min('startingDateGP'));
    $to = $request->input('to', Nasabah::max('endDateGP'));

    if ($namaFile) {
      /*$nasabah = Nasabah::where('namaFile_id', $namaFile)
      ->where(function ($query) use ($from, $to) {
      $query->where('startingDateGP', '>=', $from)
      ->where('endDateGP', '<=', $to);
      })->get();*/

      if ($namaFile == 'Semua File') {
        $nasabah = Nasabah::query();

        if ($from) {
          $nasabah->where('startingDateGP', '>=', $from);
        }
        if ($to) {
          $nasabah->where('endDateGP', '<=', $to);
        }
        $nasabah = $nasabah->get();

select * from `nasabah`
---
        $nasabah = $nasabah->get();
      }
    } else {
      $nasabah = Nasabah::all();

select * from `documents` where `documents`.`id` = 180 limit 1
select * from `documents` where `documents`.`id` = 204 limit 1
---
      'sumNasabah' => $nasabah->count(),
      'statusTIFPembiayaan' => json_encode($statusTIFPembiayaan),
      'statusPembiayaaan' => json_encode($statusPembiayaan),
      'doc180' => Documents::findOrFail(180),
      'doc204' => Documents::findOrFail(204),

select * from `nasabah` where `NasabahId` = '91851000590' limit 1
---
  public function show($idNasabah)
  {
    $nasabah = Nasabah::where('NasabahId', $idNasabah)->first();

select * from `documents`
---
  public function tableNasabah()
  {
    return view('tables', [
      'nasabah' => Nasabah::all(),
      'dokumen' => Documents::all(),
    ]);