app/Http/Controllers/NasabahController.php

  public function index()
  {
    $nasabah = Nasabah::whereIn('StatusEksekusiTIF', ['Sesuai', 'Modifikasi'])
      ->latest()
      ->limit(20)
      ->get();

    $this->nasabah = $this->statusEksekusiTIF($nasabah);
    $status = $this->polarAreaChart($nasabah);
    $filter = $this->filterData(request());
//        dd($this->nasabah);
    return view('home', [
      'status' => $this->nasabah,
      'sumNasabah' => Nasabah::count(),
      'nasabah' => Nasabah::all(),
      'statusPembiayaan' => $status,
      'filters' => $filter,
    ]);
---
select * from `nasabah` where `StatusEksekusiTIF` in ('Sesuai', 'Modifikasi') order by `created_at` desc limit 20
select count(*) as aggregate from `nasabah`

  public function tableNasabah()
  {
    return view('tables', [
      'nasabah' => Nasabah::all(),
      'dokumen' => Documents::all()
    ]);
---
select * from `documents`